Feature: Запазване на час на място

  Scenario Outline: Запазване на час на място
    Given Служителят отваря екран за запазване на час
    When Въведе първо име "<firstName>"
    And Въведе второ име "<lastName>"
    And Въведе телефонен номер "<phone>"
    And Въведе електронна поща "<email>"
    And Въведе желаната процедура <procedure>
    And Въведе дата за час "<date>"
    And Натиска върху бутона за запазване
    Then Вижда съобщение дали е успешно "<message>"

    Examples: 
      | firstName  | lastName | phone  | email | date | procedure | message |
      | Еми |     Н | 1234 | emi@emi.com | 12.02.2021 13:30:00 | 1 | Успешно |
      | Еми |       | 1234 | emi@emi.com | 12.02.2021 08:30:00 | 1 | Въведете фамилия на клиента |
      | Еми |     Н |      | emi@emi.com | 12.02.2021 13:30:00 | 1 | Въведете телефон на клиента |
      | Еми |     Н | 1234 |             | 12.02.2021 13:30:00 | 1 | Въведете електронна поща на клиента |
      | Еми |     Н | 1234 | emi@emi.com |                     | 1 | Въведете дата |
      | Еми |     Н | 1234 | emi@emi.com | 12.02.2021 13:30:00 |   | Въведете процедура |
      | Еми |     Н | 1234 | emi@emi.com | 12.02.2021          | 1 | Въведете желан час |