Feature: Запазване на час при козметик

  Scenario: Запазване на свободен час
    Given Потребителят отваря страница за запазване на час
    When Въвежда име "Еми"
    And Въвежда фамилия "Н"
    And Въвежда електронна поща "emi@emi.com"
    And Въвежда телефонен номер "1234"
    And Въвежда дата и час за запазване на час "12.02.2021 15:35:00"
    And Въвежда желаната процедура "1"
    And Натиска върху бутона Запази
    And Вижда съобщение "OK"
    And Потвърждава часът чрез пощата "Не"
    Then Вижда съобщение за потвърден час "Непотвърден час"
    
   Scenario: Запазване на час преди 10
    Given Потребителят отваря страница за запазване на час
    When Въвежда име "Еми"
    And Въвежда фамилия "Н"
    And Въвежда електронна поща "emi@emi.com"
    And Въвежда телефонен номер "1234"
    And Въвежда дата и час за запазване на час "12.02.2021 09:30:00"
    And Въвежда желаната процедура "1"
    And Натиска върху бутона Запази
    And Вижда съобщение "Извън работно време"
    And Потвърждава часът чрез пощата "Да"
    Then Вижда съобщение за потвърден час "Потвърден час"
    
   Scenario: Запазване на час след 18:30
    Given Потребителят отваря страница за запазване на час
    When Въвежда име "Еми"
    And Въвежда фамилия "Н"
    And Въвежда електронна поща "emi@emi.com"
    And Въвежда телефонен номер "1234"
    And Въвежда дата и час за запазване на час "12.02.2021 19:00:00"
    And Въвежда желаната процедура "1"
    And Натиска върху бутона Запази
    And Вижда съобщение "Извън работно време"
    And Потвърждава часът чрез пощата "Да"
    Then Вижда съобщение за потвърден час "Потвърден час"
    
   Scenario: Запазване на зает час
    Given Потребителят отваря страница за запазване на час
    When Въвежда име "Еми"
    And Въвежда фамилия "Н"
    And Въвежда електронна поща "emi@emi.com"
    And Въвежда телефонен номер "1234"
    And Въвежда дата и час за запазване на час "12.02.2021 13:40:00"
    And Въвежда желаната процедура "1"
    And Натиска върху бутона Запази
    And Вижда съобщение "Часът не е свободен"
    And Потвърждава часът чрез пощата "Да"
    Then Вижда съобщение за потвърден час "Потвърден час"
    
   Scenario: Запазване на свободен час без потвърждение по пощата
    Given Потребителят отваря страница за запазване на час
    When Въвежда име "Еми"
    And Въвежда фамилия "Н"
    And Въвежда електронна поща "emi@emi.com"
    And Въвежда телефонен номер "1234"
    And Въвежда дата и час за запазване на час "12.02.2021 15:35:00"
    And Въвежда желаната процедура "1"
    And Натиска върху бутона Запази
    And Вижда съобщение "OK"
    And Потвърждава часът чрез пощата "Не"
    Then Вижда съобщение за потвърден час "Непотвърден час"
 
